# Задача 2: Найдите сумму цифр трехзначного числа.
#*Пример:*
#123 -> 6 (1 + 2 + 3)
#100 -> 1 (1 + 0 + 0) 

print ('Введите трехзначное число ')
a = int (input())
a1 = a%10
a2 = a%100//10
a3 = a//100

print (a, ' = ', a1 + a2+ a3, '(', a1, ' + ', a2, '+', a3, ')')