# Задача 16: Требуется вычислить, сколько раз встречается некоторое 
#число X в массиве A. Пользователь в первой строке вводит натуральное 
#число N – количество элементов в массиве. В последующих  строках записаны N 
#целых чисел Ai (можно использовать псевдогенерацию). Последняя строка 
#содержит число X.
# *Пример:*
# 5 
# 7 -2 3 5 1    3     -> 1

import random
N = int(input('Введите количество элементов в массиве: ' ))
A = []
for i in range(N):
    A.append(random.randint(1, N))
print(A)

X = int(input('Введите число которое встречается в массиве: ' ))
sum = 0

for i in range (N):
    if X == A[i]:
        sum +=1

print(sum)